@extends('layouts.template')
@section('title','เกี่ยวกับระบบ')
@section('subtitle','เกี่ยวกับโครงการ สสส.')
@section('styles')
<!-- bootstrap wysihtml5 - text editor -->
<link rel="stylesheet" href="{{ asset("assets/plugins/bootstrap-wysihtml5/bootstrap3-wysihtml5.min.css") }}">
@endsection
@section('body')

<div class="row">
  <div class="col-md-12">
    <div class="box box-primary">
      <div class="box-header with-border">
        <h3 class="box-title">การออกแบบและพัฒนาระบบ</h3>
      </div>
      <div class="box-footer box-comments">
        <div class="box-comment">
          <!-- User image -->

          <div class="comment-text">
<p>โครงการวิจัย 	<b>"การพัฒนาระบบฐานข้อมูลการวิจัยและพัฒนาชุมชนท้องถิ่นน่าอยู่สำหรับเครือข่ายมหาวิทยาลัยราชภัฏ"</b></p>
<p><b>ที่มาและความสำคัญของปัญหา</b><br>
    	&emsp;&emsp;&emsp;โครงการการวิจัยและพัฒนาชุมชนท้องถิ่นน่าอยู่โดยเครือข่ายมหาวิทยาลัยราชภัฏ ได้รับการสนับสนุนโดยสำนักงานกองทุนสนับสนุนการสร้างเสริมสุขภาพ (สสส.) ซึ่งประกอบไปด้วยเครือข่ายมหาวิทยาลัยราชภัฏ และภาคีร่วมพัฒนาคือ องค์กรปกครองส่วนท้องถิ่น ส่วนท้องที่ ฝ่ายปกครอง องค์กรชุมชน และภาคราชการ โครงการนี้มีเป้าหมายให้เกิดการเรียนรู้ร่วมกันระหว่างเครือข่ายมหาวิทยาลัยราชภัฏกับชุมชนท้องถิ่น เพื่อการนำใช้ข้อมูลให้เกิดประโยชน์สู่การจัดการตนเองได้อย่างมีประสิทธิภาพและประสิทธิผล ให้บรรลุวัตถุประสงค์ในการพัฒนาระบบและกลไกการสนับสนุนการวิจัยเชิงพื้นที่ให้เกิดรูปธรรมการทำงานร่วมกันของนักวิชาการในเครือข่ายมหาวิทยาลัยราชภัฏ เครือข่ายองค์กรปกครองส่วนท้องถิ่นและภาคีในการเสริมสร้างความเข้มแข็งของชุมชน และนำใช้ข้อมูลสู่การสร้างองค์ความรู้และนวัตกรรมที่เหมาะสมสำหรับการพัฒนาพื้นที่ต้นแบบสุขภาวะ โดยพัฒนาชุดความรู้ คู่มือ องค์ความรู้และนวัตกรรม เครื่องมือทางวิชาการที่ชุมชนท้องถิ่นสามารถนำใช้ในการต่อยอดขยายผลสู่การจัดการตนเองอย่างยั่งยืน  โครงการนี้มีพื้นที่เป้าหมาย ได้แก่ องค์กรปกครองส่วนท้องถิ่นที่เป็นศูนย์จัดการเครือข่ายสุขภาวะชุมชน จำนวน ๑๐ แห่ง และองค์กรปกครองส่วนท้องถิ่นเครือข่าย จำนวน ๒๐๐ แห่ง มีกลุ่มเป้าหมายคือ นักศึกษา อาจารย์ บุคลากรขององค์กรปกครองส่วนท้องถิ่น และแกนนำชุมชน
    	การสร้างองค์ความรู้และนวัตกรรมที่เหมาะสมกับการพัฒนาเชิงพื้นที่ (Research Project) โดยใช้หลักการสนับสนุนทุนวิจัยจากโจทย์ในพื้นที่สร้างกระบวนการเรียนรู้งานวิจัยเชิงพื้นที่ระหว่างนักวิจัยของมหาวิทยาลัยและนักวิจัยในพื้นที่ ให้เกิดการสร้างองค์ความรู้และนวัตกรรมที่เหมาะสมกับการพัฒนาเชิงพื้นที่ และพัฒนาฐานข้อมูลด้านการวิจัย (ข้อมูลจากมหาวิทยาลัยราชภัฏเครือข่าย) สำหรับการจัดการตนเองและยกระดับต่อเนื่อง (Data base Development) จนสามารถพัฒนาชุดความรู้ คู่มือ เครื่องมือเพื่อสร้างองค์ความรู้ และนวัตกรรมที่เหมาะสมกับพื้นที่ได้ การพัฒนาระบบศูนย์กลางสำหรับการจัดการข้อมูลทั้งระบบจึงมีบทบาทและความจำเป็นสำหรับการสนับสนุนกระบวนการนี้ให้สำเร็จลุล่วงและเกิดการนำไปใช้ประโยชน์ได้อย่างเป็นรูปธรรม<br>
    &emsp;&emsp;&emsp;ดังนั้น ทีมผู้วิจัยจึงประยุกต์ใช้ระบบฐานข้อมูลและการพัฒนาแอพพลิเคชันสำหรับการจัดการข้อมูลที่สอดคล้องกับโครงการ ได้แก่ การบริหารข้อมูลพื้นที่ชุมชน การรวบรวมข้อมูลงานวิจัย บทความวิจัย นักวิจัย และผู้เชี่ยวชาญ ที่ประกอบไปด้วยฐานข้อมูลที่สามารถเชื่อมโยงประมวลผลข้อมูลร่วมกัน นำเข้าข้อมูลด้วยรูปแบบเดียวกัน ทำให้เกิดฐานข้อมูลอย่างเป็นระบบและสามารถจัดเก็บประวัติในการดำเนินกิจกรรมของโครงการที่สามารถเรียกแสดงข้อมูลย้อนหลังได้
</p>
<p><b>หน่วยงานร่วมพัฒนา</b><br>
&emsp;&emsp;&emsp;1. มหาวิทยาลัยราชภัฏอุตรดิตถ์<br>
&emsp;&emsp;&emsp;2. มหาวิทยาลัยราชภัฏพิบูลสงคราม<br>
&emsp;&emsp;&emsp;3. มหาวิทยาลัยราชภัฏนครปฐม<br>
&emsp;&emsp;&emsp;4. มหาวิทยาลัยราชภัฏบุรีรัมย์<br>
&emsp;&emsp;&emsp;5. มหาวิทยาลัยราชภัฏสุราษฏร์ธานี<br>
&emsp;&emsp;&emsp;6. มหาวิทยาลัยราชภัฏลำปาง<br>
&emsp;&emsp;&emsp;7. มหาวิทยาลัยราชภัฏเลย<br>
&emsp;&emsp;&emsp;8. มหาวิทยาลัยราชภัฏเพชรบุรี<br>
&emsp;&emsp;&emsp;9. มหาวิทยาลัยราชภัฏวไลยลงกรณ์<br>
&emsp;&emsp;&emsp;10. มหาวิทยาลัยราชภัฏมหาสารคาม<br>
&emsp;&emsp;&emsp;11. ศูนย์จัดการเครือข่ายสุขภาวะชุมชน (ศจค.) 10 พื้นที่เป้าหมาย<br>
&emsp;&emsp;&emsp;12. อปท.เครือข่ายศูนย์จัดการเครือข่ายสุขภาวะชุมชน 200 พื้นที่<br>
</p>
<p><b>โจทย์วิจัย</b><br>
&emsp;&emsp;&emsp;การพัฒนาระบบฐานข้อมูลโครงการวิจัยและพัฒนาชุมชนท้องถิ่นน่าอยู่ สามารถนำมาเป็นเครื่องมือของนักบริหารจัดการข้อมูลสำหรับพัฒนาชุมชนท้องถิ่นน่าอยู่ จะทำได้อย่างไร
</p>
<p><b>วัตถุประสงค์ของโครงการวิจัย</b><br>
&emsp;&emsp;&emsp;1.เพื่อออกแบบและพัฒนาระบบฐานข้อมูลการวิจัยและพัฒนาชุมชนท้องถิ่นน่าอยู่สำหรับเครือข่ายมหาวิทยาลัยราชภัฏ<br>
&emsp;&emsp;&emsp;2.เพื่อหาประสิทธิภาพการใช้ระบบฐานข้อมูลการวิจัยและพัฒนาชุมชนท้องถิ่นน่าอยู่สำหรับเครือข่ายมหาวิทยาลัยราชภัฏ
</p>
<p><b>ผลและประโยชน์ที่คาดว่าจะได้รับจากงานวิจัย</b><br>
&emsp;&emsp;&emsp;1)	ได้ศูนย์กลางข้อมูลสำหรับโครงการวิจัยและพัฒนาชุมชนน่าอยู่<br>
&emsp;&emsp;&emsp;2)	ได้ข้อมูลโครงการวิจัยและพัฒนาชุมชนที่นำไปใช้ในการพัฒนาให้ชุมชนน่าอยู่<br>
&emsp;&emsp;&emsp;3)	เกิดการแก้ไขปัญหาในพื้นที่ชุมชนได้อย่างมีประสิทธิภาพ<br>
&emsp;&emsp;&emsp;4)	เกิดรูปแบบการบริหารจัดการข้อมูลเชิงพื้นที่อย่างมีประสิทธิภาพ<br>
&emsp;&emsp;&emsp;5)	เกิดการขยายผลการใช้ระบบต่อไปในอนาคต<br>
</p>

<p><b>ขอบเขตของโครงการวิจัย</b><br>
&emsp;&emsp;1. ขอบเขตด้านข้อมูล ประกอบไปด้วยโครงสร้างฐานข้อมูล 11 ฐานข้อมูล ดังนี้<br>
&emsp;&emsp;&emsp;1)	ฐานข้อมูลมหาวิทยาลัยราชภัฏ<br>
&emsp;&emsp;&emsp;2)	ฐานข้อมูลศูนย์จัดการเครือข่าย<br>
&emsp;&emsp;&emsp;3)	ฐานข้อมูลพื้นที่ชุมชน<br>
&emsp;&emsp;&emsp;4)	ฐานข้อมูลพื้นที่ชุมชนและปัญหาชุมชน<br>
&emsp;&emsp;&emsp;5)	ฐานข้อมูลนักวิจัย<br>
&emsp;&emsp;&emsp;6)	ฐานข้อมูลงานวิจัย<br>
&emsp;&emsp;&emsp;7)	ฐานข้อมูลผู้เชี่ยวชาญ<br>
&emsp;&emsp;&emsp;8)	ฐานข้อมูลความเชี่ยวชาญ<br>
&emsp;&emsp;&emsp;9)	ฐานข้อมูลผลงานสร้างสรรค์<br>
&emsp;&emsp;&emsp;10)	ฐานข้อมูลโครงการวิจัย สสส.<br>
&emsp;&emsp;&emsp;11)	ฐานข้อมูลการใช้ประโยชน์<br>
&emsp;&emsp;2. ขอบด้านซอฟต์แวร์ ประกอบด้วย<br>
&emsp;&emsp;&emsp;1.	ระบบจัดการข้อมูลระบบ<br>
&emsp;&emsp;&emsp;2.	ระบบจัดการข้อมูลสมาชิก<br>
&emsp;&emsp;&emsp;3.	ระบบจัดการข้อมูลหน่วยงานและพื้นที่ชุมชน<br>
&emsp;&emsp;&emsp;4.	ระบบจัดการข้อมูลนักวิจัย<br>
&emsp;&emsp;&emsp;5.	ระบบจัดการข้อมูลผู้เชี่ยวชาญ<br>
&emsp;&emsp;&emsp;6.	ระบบจัดการข้อมูลงานวิจัย<br>
&emsp;&emsp;&emsp;7.	ระบบจัดการข้อมูลบทความวิจัย<br>
&emsp;&emsp;&emsp;8.	ระบบจัดการข้อมูลโครงการ สสส.<br>
&emsp;&emsp;&emsp;9.	ระบบจัดการข้อมูลปัญหาชุมชน<br>
&emsp;&emsp;&emsp;10.	 ระบบจัดการข้อมูลการใช้ประโยชน์<br>
&emsp;&emsp;&emsp;11.	 ระบบประมวลผลข้อมูลโจทย์วิจัยคุณภาพ<br>
&emsp;&emsp;&emsp;12.	 ระบบประมวลผลข้อมูลสนับสนุนการตัดสินใจ<br>
</p>
</div>
</div>
</div>
<div class="box-body">
  <img class="img-responsive pad" src="{{url('images/system/5.png')}}">
</div>
<div class="box-footer box-comments">
<div class="box-comment">
<div class="comment-text">
<p><b>กรอบแนวคิดในงานวิจัย</b><br>
&emsp;&emsp;&emsp;กรอบแนวคิดในงานวิจัยมีปัจจัยนำเข้าระบบคือ ข้อมูลหน่วยงานมหาวิทยาลัย ข้อมูลพื้นที่ชุมชนและปัญหาชุมชน
ข้อมูลนักวิจัย งานวิจัย บทความวิจัย ผู้เชี่ยวชาญ และผลการใช้ประโยชน์ ซึ่งจะถูกรวบรวมรูปแบบฐานข้อมูลที่มีความสัมพันธ์กัน
และพัฒนาระบบจัดการฐานข้อมูลเพื่อสนับสนุนผู้ใช้และประมวลผลเพื่อให้ได้ข้อมูลที่นำมาใช้สนับสนุนการตัดสินใจและบริหารจัดการ
เพื่อแก้ไขปัญหาของชุมชนได้ตรงกับสภาพความเป็นจริงของชุมชน จะทำให้เกิดความร่วมมือและทำให้ชุมชนท้องถิ่นน่าอยู่ขึ้น<br>
&emsp;&emsp;&emsp;การวิเคราะห์ระบบ พบว่ากลุ่มข้อมูลที่สัมพันธ์กับการใช้ระบบ ประกอบไปด้วย มหาวิทยาลัยราชภัฏ
ที่จะเป็นผู้กำหนดหน่วยงานที่รับผิดชอบ (ศจค.) และกำหนดพื้นที่ชุมชนที่ดำเนินการ เพื่อให้หน่วยพี้นที่ (อปท.)
บันทึกข้อมูลเกี่ยวกับชุมชน ส่วนหน่วยงานมหาวิทยาลัยราชภัฏจะบันทึกข้อมูล นักวิจัย ผู้เชี่ยวชาญ งานวิจัย บทความวิจัย
ลงในระบบฐานข้อมูล โดยมีกลุ่มโจทย์/ความเชี่ยวชาญ ที่เป็นข้อมูลสำหรับการเชื่อมความสัมพันธ์ของชุมชนกับข้อมูลที่
จะสนับสนุนการเพื่อการแก้ไขปัญหา ผลจากการนำไปใช้ประโยชน์จะถูกบันทึกลงในระบบเช่นเดียวกัน
ข้อมูลที่บันทึกทั้งหมดจะเชื่อมกันและมีความสัมพันธ์ ทำให้สามารถประมวลผลข้อมูลได้ 4 ด้านคือ การพัฒนาโจทย์วิจัยคุณภาพ
ข้อมูลสนับสนุนการตัดสินใจ ระบบสนับสนุนการใช้ประโยชน์ และสร้างระบบสารสนเทศนำเสนอข้อมูลสรุปของระบบ
&emsp;&emsp;&emsp;การวิเคราะห์บทบาทผู้ใช้ ทำให้ได้กิจกรรมที่แบ่งตามผู้ใช้ได้ดังนี้<br>
&emsp;&emsp;<b>1)	ผู้ดูแลระบบ</b><br>
&emsp;&emsp;&emsp;-	กำหนดข้อมูลโครงสร้างของระบบ<br>
&emsp;&emsp;&emsp;-	จัดการข้อมูลสมาชิก<br>
&emsp;&emsp;&emsp;-	กำหนดสิทธิ์ผู้ใช้งานระบบ<br>
&emsp;&emsp;&emsp;-	จัดการข้อมูลหน่วยงาน<br>
&emsp;&emsp;&emsp;-	วิเคราะห์ข้อมูลการใช้ระบบ<br>
&emsp;&emsp;<b>2)	มหาวิทยาลัยราชภัฏ</b><br>
&emsp;&emsp;&emsp;-	กำหนดพื้นที่ที่รับผิดชอบ<br>
&emsp;&emsp;&emsp;-	บันทึกข้อมูลนักวิจัย<br>
&emsp;&emsp;&emsp;-	บันทึกข้อมูลงานวิจัย<br>
&emsp;&emsp;&emsp;-	บันทึกข้อมูลบทความวิจัย<br>
&emsp;&emsp;&emsp;-	บันทึกข้อมูลผู้เชี่ยวชาญ<br>
&emsp;&emsp;&emsp;-	บันทึกข้อมูลโครงการ<br>
&emsp;&emsp;&emsp;-	บันทึกผลการนำไปใช้ประโยชน์<br>
&emsp;&emsp;&emsp;-	ประมวลผลโจทย์วิจัยคุณภาพ<br>
&emsp;&emsp;&emsp;-	ระบบสารสนเทศ และระบบสนับสนุนการตัดสินใจ<br>
&emsp;&emsp;<b>3)	ศูนย์จัดการเครือข่าย</b><br>
&emsp;&emsp;&emsp;-	จัดการข้อมูลหน่วยงาน<br>
&emsp;&emsp;&emsp;-	บันทึกข้อมูลและปัญหาชุมชน<br>
&emsp;&emsp;&emsp;-	บันทึกข้อมูลผู้เชี่ยวชาญและงานวิจัย<br>
&emsp;&emsp;&emsp;-	บันทึกผลการนำไปใช้ประโยชน์<br>
&emsp;&emsp;&emsp;-	ประมวลผลโจทย์วิจัยคุณภาพ<br>
&emsp;&emsp;&emsp;-	ระบบสารสนเทศ และระบบสนับสนุนการตัดสินใจ<br>
&emsp;&emsp;<b>4)	หน่วยพื้นที่</b><br>
&emsp;&emsp;&emsp;-	จัดการข้อมูลพื้นที่ชุมชน<br>
&emsp;&emsp;&emsp;-	บันทึกข้อมูลและปัญหาชุมชน<br>
&emsp;&emsp;&emsp;-	บันทึกข้อมูลผู้เชี่ยวชาญและงานวิจัย<br>
&emsp;&emsp;&emsp;-	บันทึกผลการนำไปใช้ประโยชน์<br>
&emsp;&emsp;&emsp;-	ประมวลผลโจทย์วิจัยคุณภาพ<br>
&emsp;&emsp;&emsp;-	ระบบสารสนเทศ และระบบสนับสนุนการตัดสินใจ<br>
&emsp;&emsp;<b>5)	บุคคลทั่วไป</b><br>
&emsp;&emsp;&emsp;-	ระบบสารสนเทศสรุปข้อมูลระบบ<br>
&emsp;&emsp;&emsp;-	ระบบสนับสนุนการตัดสินใจ<br>
&emsp;&emsp;&emsp;-	สารสนเทศการนำไปใช้ประโยชน์<br>
</p>

<p><b>การออกแบบแอพพลิเคชัน</b><br>
&emsp;&emsp;&emsp;กระบวนการของโปรแกรม ที่มีความสัมพันธ์กับผู้ใช้และข้อมูลระบบ สามารถแยกเป็นโปรแกรมย่อยหรือโมดูล ได้ 12 โมดูล ดังนี้
1)	ระบบจัดการข้อมูลระบบ
2)	ระบบจัดการข้อมูลสมาชิก
3)	ระบบจัดการข้อมูลหน่วยงานและพื้นที่ชุมชน
4)	ระบบจัดการข้อมูลนักวิจัย
5)	ระบบจัดการข้อมูลผู้เชี่ยวชาญ
6)	ระบบจัดการข้อมูลงานวิจัย
7)	ระบบจัดการข้อมูลบทความวิจัย
8)	ระบบจัดการข้อมูลโครงการ สสส.
9)	ระบบจัดการข้อมูลปัญหาชุมชน
10)	 ระบบจัดการข้อมูลการใช้ประโยชน์
11)	 ระบบประมวลผลข้อมูลโจทย์วิจัยคุณภาพ
12)	 ระบบประมวลผลข้อมูลสนับสนุนการตัดสินใจ

</p>
<p><b>ผู้รับผิดชอบโครงการวิจัย</b><br>
&emsp;&emsp;&emsp;หัวหน้าโครงการ อาจารย์ภานุวัฒน์ ขันจา	หลักสูตรวิศวกรรมคอมพิวเตอร์ คณะเทคโนโลยีอุตสาหกรรม  มหาวิทยาลัยราชภัฏอุตรดิตถ์<br>
&emsp;&emsp;&emsp;ภายใต้ สถาบันวิจัยและพัฒนา มหาวิทยาลัยราชภัฏอุตรดิตถ์
</p>
</div>


</div>
</div>
  </div>


</div>
</div>

  @endsection

  @section('script')
  <!-- Bootstrap WYSIHTML5 -->
  <script src="{{ asset("assets/plugins/bootstrap-wysihtml5/bootstrap3-wysihtml5.all.min.js") }}"></script>

  @endsection
